
#include <iostream>
#include "basics.h"
#include "shop/Laptop.h"

void basics() {
	std::cout << "OOP Basics" << std::endl;
	Laptop* acer = new Laptop();
	acer->setName("Acer Nitro");
	acer->setPrice(60499);
	acer->setPower(90);
	acer->setHardware("Intel Core 5 Ram 16GB SSD 512GB");

	std::cout << acer->toString() << std::endl;
}

/*
 Основні принципи ООП.
 Абстрагування, спадкування, поліморфізм, інкапсуляція. 

 Абстракція - термін, що означає поєднання деякої множини сутностей.
 Приклад - природна мова. Майже будь - яке слово значить множину.
 "Телефон" - величезна множина реальних речей (сутностей).
 Машинним мовам абстракція не властива, інструкції мають чітке вираження.
 Абстрагування - побудова мовних конструкцій, здатних поєднувати 
 множинні властивості (сутності та інші абстракції).

 Створення абстракцій передбачає вивчення (аналіз) предметної області
 (чому присвячена програма). Наприклад, крамниця. 
 Виписуємо усі товари, що мають бути в крамниці, з усіма їх важливими характеристиками.

 Ноутбук				Монітор					Мина				Клавіатура
 - назва				- назва					- назва				- назва
 - ціна					- ціна					- ціна				- ціна
 - "залізо"				- діагональ				- DPI				- тип
 - потужність			- потужність			- підключення		- підключення

 1) Знаходимо, що є спільного у ВСІХ сутностей: назва та ціна.
 Формуємо вищу абстракцію: товар(Product), що поєднує все, що в нас є.
								Product
								- назва			- інкапсуляція - переміщення спільних властивостей до абстракцій.
								- ціна
		/					/				   \				   \
 Ноутбук				Монітор					Мина				Клавіатура
 - "залізо"				- діагональ				- DPI				- тип
 - потужність			- потужність			- підключення		- підключення

 2) Знаходимо групи зі спільними властивостями і будуємо наступний рівень абстракцій:
 Електротовари (-потужність)					Переферія (-підключення)

								  Product
								  - назва	
								  - ціна
							   /		   \
				 Електротовари				 Переферія
				 (-потужність)				 (-підключення)
				/		 	  \				 /  		   \
			Ноутбук			 Моніто			Миша		Клавіатура
			- "залізо"		 - діагонал		- DPI		- тип

 Повторюємо п.2) для всіх можливих групувань
 ----------------------------------------------------------------------------------------------------
 Спадкування - механізм реалізації абстрагування - створення класів на базі інших класів з їх розширенням.
 Дочірній клас (нащадок) повністю включає в себе батьківський клас і може додавати власні елементи. 
 Спадкування може бути каскадним, тобто електротовари спадкуються від Товару,
 а Ноутбук - від Електротовару (а значить і від товару).
 Але на відміну від простого розширення, спадкування зберігає типізацію, тобто Ноутбук окрім того,
 що сам є типом, також є типом Електротовар і Товар.

*/