
/*
 ООП. Вступ.
 Парадигма - термін, що поєднує традиції, підходи, прийоми, методики тощо.
 У програмуванні існують декілька парадигм:
 - Імперативна парадигма (в яку входить процедурний підхід)
   програма вважається послідовністю інструкцій, серед яких лише одна
   виконується у даний момент часу. Окремі інструкції програми дозволяють
   змінювати порядок виконання (умови, цикли)
   Процедурний підхід - організація коду у вигляді набору процедур,
   тіла яких є послідовностями інструкцій.
 - Функціональна парадигма - базується на матиматично - функціональних засадах.
   Програма вважвється "конвертом" у якому лежить інструкція, що слід зробити,
   та новий "конверт" над яким слід виконати цю дію.
   Представники: LIPS, Python, J, TCL, Haskel.
 - Декларативна парадигма (в яку входить логічна) - базується на теорії знань.
   Програма складається з набору правил (аксіом) та твердження, яке слід перевірити (теореми). 
   Представник: Prolog (5 покоління)
 - Об'єктно орієнтована парадигма (ООП) - базується на принципах взаємодії,
   розроблялась як засіб описання еволюційних систем, у яких задаються об'єкти та правила їх взаємодії.
   Суть програми - еволюція системи об'єктів. З точки зору практичного програмування вносить ідею колекцій - 
   як розвиток поняття масиву, але з можливістю змін розміру (через еволюцію - роботу програми).
   Представники ООП: С#, Java, прототипної підпарадигми: JavaScript, Python, PHP.
*/

/*
 Центральним поняттям ООП є "клас" та "об'єкт"
 Клас - тип даних (аналогічний структурі), що дозволяє поєднувати інші типи,
 а також методи. Клас можна порівняти з "кресленням" за яких створюються об'єкти.
 Об'єкт - цце елемент (instance) класу.

*/